app/controllers/entries_controller.rb

INSERT INTO "comments" ("created_at", "description", "entry_id", "name", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", 2012-11-04 11:01:12 UTC], ["description", "estilazo"], ["entry_id", 4], ["name", nil], ["updated_at", Sun, 04 Nov 2012 11:01:12 UTC +00:00]]
SELECT "entries".* FROM "entries" WHERE "entries"."id" = ? LIMIT 1  [["id", "4"]]
---
 def comment
   Entry.find(params[:id]).comments.create(params[:comment])

INSERT INTO "entries" ("created_at", "creation_date", "description", "pic", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @entry = Entry.new(params[:entry])

    respond_to do |format|
      if @entry.save

SELECT "entries".* FROM "entries" WHERE "entries"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "entries" SET "title" = 'holadew', "updated_at" = '2012-11-02 18:52:19.902271' WHERE "entries"."id" = 1
---
  def update
    @entry = Entry.find(params[:id])

    respond_to do |format|
      if @entry.update_attributes(params[:entry])